IRP/src/InformationRegisters/CompanyLadgerTypes/CompanyLadgerTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CompanyLadgerTypes</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Use</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LadgerType</name>
    <type>
      <types>CatalogRef.LadgerTypes</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

IRP/src/CommonModules/AccountingServer/Module.bsl
Function GetLadgerTypesByCompany(Ref, Date, Company) Export
	If Not ValueIsFilled(Company) Then
		Return New Array();
	EndIf;
	Query = New Query();
	Query.Text = 
	"SELECT
	|	CompanyLadgerTypesSliceLast.LadgerType
	|FROM
	|	InformationRegister.CompanyLadgerTypes.SliceLast(&Period, Company = &Company) AS CompanyLadgerTypesSliceLast
	|WHERE
	|	CompanyLadgerTypesSliceLast.Use";
	Period = CalculationStringsClientServer.GetSliceLastDateByRefAndDate(Ref, Date);
	Query.SetParameter("Period", Period);
	QueryResult = Query.Execute();
	QueryTable = QueryResult.Unload();
	ArrayOfLadgerTypes = QueryTable.UnloadColumn("LadgerType");
	Return ArrayOfLadgerTypes;
EndFunction
